picohari/freertos_stm32f4/alt/main_testing.c
/**
  ******************************************************************************
  * @file    src/main.c 
  * @author  Harald W. Leschner (DK6YF) - H9 Laboratory Ltd.
  * @version V1.0.0
  * @date    15-July-2017
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>

#include "config.h"

/* XCore drivers */
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "XCore407I.h"

/* Hardware peripherals */
#include "uart.h"
#include "rtc_clock.h"
#include "eth_if.h"
#include "flashdrive.h"
#include "adc.h"

#include "onewire.h"
#include "ds18b20.h"

/* GUI and interfaces */
#include "gfx.h"
//#include "gui.h"
//#include "pages/zen_menu.h"
//#include "vt100.h"
#include "test.h"

/* LWIP stack */
#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dns.h"

/* NTP, DNS and DHCP */
#include "lwip/apps/sntp.h"
#include "dhcp_eth.h"

/* HTTP server */
#include "httpd_server.h"
//#include "test_server.h"

/* Clients */
#include "httplog.h"
//#include "lwip/apps/mqtt.h"
#include "MQTTlwip.h"
#include "MQTTClient.h"


/* FatFs includes component */
#include "ff_gen_drv.h"
#include "usbh_diskio.h"


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LED1_UPDATE_DELAY   125
#define LED2_UPDATE_DELAY   250



/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
osThreadId LEDThread1Handle, LEDThread2Handle;

  
FATFS   USBDISKFatFs;           /* File system object for USB disk logical drive */
char    USBDISKPath[4];         /* USB Host logical drive path */

FIL     MyFile;                 /* File object */

USBH_HandleTypeDef hUSB_Host;   /* USB Host handle */

typedef enum {
  DISCONNECTION_EVENT = 1,  
  CONNECTION_EVENT,    
}MSC_ApplicationTypeDef;

typedef enum {
  DISK_READY_EVENT = 1,  
  DISK_REMOVE_EVENT,    
}FatFs_DiskTypeDef;


osMessageQId AppliEvent;
osMessageQId DiskEvent;




/* Private function prototypes -----------------------------------------------*/
static void os_init(void);
static void os_tasks(void);
static void SystemClock_Config(void);

static void Register_printout(void);


/* Threads and startup tasks */
static void LED1_thread (void const * arg);   /* Blink LED 1 */
static void LED2_thread (void const * arg);   /* Blink LED 2 */

static void GUI_start   (void const * arg);   /* Initiate LCD and uGFX */
static void GUI_thread  (void const * arg);   /* Operate GUI */

static void NET_start   (void const * arg);   /* ETH Networking */
static void HTTP_start  (void const * arg);   /* HTTP Server */

static void MQTT_start  (void const * arg);   /* MQTT Server + Client */
//static void MQTT_connect(mqtt_client_t *client);


static void TTY_thread  (void const * arg);   /* TTY Console command interpreter */
static void RTC_thread  (void const * arg);   /* Real Time Clock */
static void ADC_thread  (void const * arg);   /* Read ADC input */

//static void OW_thread   (void const * arg);   /* Read ONEWIRE Temperature Sensor */


/* USB Tasks */
static void USB_thread  (void const * arg);
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id);
static void MSC_Application(void);

static void DISK_thread (void const * arg);




/* Private functions ---------------------------------------------------------*/
static void os_init(void)
{
  /* STM32F4xx HAL library initialization:
       - Configure the Flash prefetch, instruction and Data caches
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
  */
  HAL_Init();
  
  /* Configure the system clock to 168 MHz */
  SystemClock_Config();
  HAL_NVIC_SetPriority(SysTick_IRQn, 0x0, 0x0);

  /* Configure LEDs */
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Init(LED3);
  BSP_LED_Init(LED4);

  /* Configure UART */
  uart_init();

  /* Configure RTC */
  rtc_init();
  RTC_CalendarConfig(17, 1, 1, 0, 0, 0);

  Register_printout();

  /* Configure ADC Temperature Sensor */
  //adc_temp_init();

