picohari/freertos_stm32f4/alt/main_testing.c
}


/**
  * @brief  User Process
  * @param  phost: Host handle
  * @param  id: Host Library user message ID
  * @retval None
  */
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id)
{  
  switch(id)
  { 
  case HOST_USER_SELECT_CONFIGURATION:
    break;
    
  case HOST_USER_DISCONNECTION:
    BSP_LED_Off(LED4);
    osMessagePut(AppliEvent, DISCONNECTION_EVENT, 0);
    break;
    
  case HOST_USER_CLASS_ACTIVE:
    osMessagePut(AppliEvent, CONNECTION_EVENT, 0);
    break;
    
  default:
    break; 
  }
}



#include "settings.h"


static void DISK_thread(void const * arg)
{
  
  (void) arg;

  osEvent event;
  
  //FRESULT res;                                          /* FatFs function common result code */
  //uint16_t byteswritten;                                /* File write count */
  //uint8_t wtext[] = "This is STM32 working with FatFs"; /* File write buffer */
  
  for( ;; )
  {
    event = osMessageGet(DiskEvent, osWaitForever);
    
    if(event.status == osEventMessage)
    {
      switch(event.value.v)
      {
      case DISK_READY_EVENT:
        writef("USBDisk mounted.\r\n");
        
        osDelay(500);
        
        ini_create_file();
        ini_parse_file("SETTINGS.water");
        
        break;
        
      case DISK_REMOVE_EVENT:
        /* Unlink the USB disk I/O driver */
        FATFS_UnLinkDriver(USBDISKPath);
        break;
        
      default:
        break; 
      }
    }
  }
}


























static void NET_start (void const * arg)
{

  (void) arg;

  static ip_addr_t ipaddr;
  static ip_addr_t netmask;
  static ip_addr_t gw;

  static ip_addr_t dns;

#ifdef USE_DHCP
  ipaddr.addr = 0;
  netmask.addr = 0;
  gw.addr = 0;
#else
  /* IP address default setting */
  IP4_ADDR(&ipaddr, IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
  IP4_ADDR(&netmask, NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
  IP4_ADDR(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
#endif

  //lwip_init(); /* TODO: Check this */ 
  tcpip_init(NULL,NULL);

  /* Add the network interface */
  netif_add(&gnetif, &ipaddr, &netmask, &gw, NULL, &ethernetif_init, &tcpip_input);

  /* Registers the default network interface */
  netif_set_default(&gnetif);

  if (netif_is_link_up(&gnetif))
  {
    /* When the netif is fully configured this function must be called */
    netif_set_up(&gnetif);
  }
  else
  {
    /* When the netif link is down this function must be called */
    netif_set_down(&gnetif);
  }

  /* Start DNS service - set to ip of gateway (most routers do offer dns) */
  dns_init();
  IP4_ADDR(&dns, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
  dns_setserver(0, &dns);

#if 0
  /* Start NTP service */
  sntp_setoperatingmode(SNTP_OPMODE_POLL);
  sntp_setservername(0, "de.pool.ntp.org");
  sntp_init();
#endif

  /* Test httplog */
  //int numberone = 123;
  //httplog("led1=%d", numberone);

  /* Start HTTP service */
  osThreadDef(http, HTTP_start,    osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
  osThreadCreate( osThread(http),  NULL);

  /* Start MQTT service */
  osThreadDef(mqtt, MQTT_start,    osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  osThreadCreate( osThread(mqtt),  NULL);

  while (1) {
    osThreadTerminate( NULL );  /* important to stop task here !! */
  }

}


static void HTTP_start (void const * arg)
{

  (void) arg;

  /* Starts the httpd server */
  http_server_init();
  //http_server_socket_init();

  while(1) {

  }

}







void messageArrived(MessageData* md)
{
  MQTTMessage* message = md->message;

  writef("  Topic: %.*s\r\n", md->topicName->lenstring.len, md->topicName->lenstring.data);
  writef("Payload: %.*s\r\n", (int)message->payloadlen, (char*)message->payload);



  if (strncmp((char *) message->payload, "on", (int) message->payloadlen) == 0) {
    writef("ON\r\n");
    //gwinSetText(ghScaleADCvalue, "ON", 1);

  } else if (strncmp((char *) message->payload, "off", (int) message->payloadlen) == 0) {
    writef("OFF\r\n");
    //gwinSetText(ghScaleADCvalue, "OFF", 1);
  }
}






static void MQTT_start (void const * arg)
{

  (void) arg;


  int rc = 0;
  Network n;
  Client c;
  unsigned char sendbuf[100];   /* Sending   buffer */
  unsigned char readbuf[100];   /* Receiving buffer */

  ip4_addr_t broker_ipaddr;
  //IP4_ADDR( &broker_ipaddr, 192, 168, 1, 101);
  IP4_ADDR( &broker_ipaddr, 37, 61, 201, 83);     // cumulus.intewa.net:15672


  //err_t err;

  mqtt_lwip_init(&n);


  rc = mqtt_lwip_connect(&n, &broker_ipaddr, 1883);

  if (rc != 0) {
    writef("Failed to connect to MQTT server\r\n");

    goto blink_to_death;
  }

  writef("Initializing MQTT service\r\n");

  MQTTClient(&c, &n, 1000, sendbuf, 100, readbuf, 100);

  MQTTPacket_connectData data = MQTTPacket_connectData_initializer;
  
  char clientID_buf[256] = {0};

  sprintf(clientID_buf, "AL-MS-CU_%02lx%02lx%02lx%02lx%02lx%02lx", 
    (uint32_t) MAC_ADDR0, 
    (uint32_t) MAC_ADDR1, 
    (uint32_t) MAC_ADDR2, 
    (uint32_t) MAC_ADDR3, 
    (uint32_t) MAC_ADDR4, 
    (uint32_t) MAC_ADDR5);  

  data.clientID.cstring = clientID_buf;
  data.username.cstring = "device";
  data.password.cstring = "device";
  
  data.MQTTVersion = 3;
  data.willFlag = 0;
  data.keepAliveInterval = 5;
  data.cleansession = 1;
  
  rc = MQTTConnect(&c, &data);
  
  if (rc == MQTT_FAILURE) {
    writef("Failed to send connect request\r\n");
    goto blink_to_death;
  }

  writef("Subscribing to its topic\r\n");


  char topic_buf[128] = {0};

  sprintf(topic_buf, "%02lx:%02lx:%02lx:%02lx:%02lx:%02lx/do/#",
    (uint32_t) MAC_ADDR0, 
    (uint32_t) MAC_ADDR1, 
    (uint32_t) MAC_ADDR2, 
    (uint32_t) MAC_ADDR3, 
    (uint32_t) MAC_ADDR4, 
    (uint32_t) MAC_ADDR5); 

  rc = MQTTSubscribe(&c, topic_buf, QOS0, messageArrived);

  //rc = MQTTSubscribe(&c, "hello/world", QOS0, messageArrived);
  
  if (rc == MQTT_FAILURE) {
    writef("Failed to subscribe to its topic\r\n");
    MQTTDisconnect(&c);
    goto blink_to_death;
  }

  writef("Connected to MQTT server...\r\n");



  while(1) {

    MQTTMessage message;
    
    unsigned char sendtemp[] = {'0', '0', '.', '0', '0', 0 };

